import swal from "sweetalert2";
import "sweetalert2/src/sweetalert2.scss";

import { mapGetters, mapActions } from "vuex";


import moment from 'moment';
import { useAppSidebarMenuStore } from '@/pinia/app-sidebar-menu';


export function function1() {
    console.log("This is a global function11113333");

    const appSidebarMenu = useAppSidebarMenuStore();

    const newItem2 = {
        url: '/email', icon: 'fa fa-hdd', title: 'Email4444',
        children: [
            { url: '/t02', icon: 'fa fa-file', title: 'New Page24444' },

        ]
    };
    // console.log("!!!!!!!!!!!!! ", appSidebarMenu)
}

export function function2() {
    // console.log("This is a global function2222");
}

export function logoutUtil() {
    console.log("logoutUtil");
    this.$router.push({ path: "/auth/signin" });
    // console.log("!!!!!!!!!!!!! ", appSidebarMenu)
}

// export function convertToJSON(dataArray, labelArray) {
//     const inputString = `external_committee,0,,外部審查,EXTERNAL,外部審查委員預設單位,hyweb,2,1,18-7月 -11 05.14.48.736000000 下午,hyweb,
// 8a8a84d92f66c96f012f7765abc3000d,2,2,學術發展處,PD,,890605-1,2,1,23-8月 -17 02.11.51.868000000 下午,10504,0
// 8a8a84d93079c04001307a11e7c00001,2,1,群體健康科學研究所,PH,,860910,12,1,30-10月-12 04.36.50.807000000 下午,hyweb,0
// 8a8a84d93079c04001307a1315c10002,2,1,癌症研究所,CA,,850107,2,1,01-8月 -13 02.02.36.722000000 下午,10504,0
// 8a8a84d93079c04001307a1391d60003,2,2,技轉及育成中心,TI,,80307,3,1,12-3月 -19 02.34.05.862000000 下午,10504,0
// 8a8a89fd2ed7c3f0012ed7c5d8e90001,2,3,總辦事處,AD,,070622-2,1,1,11-5月 -20 10.27.13.851000000 上午,10504,0
// dept_root_id,0,,財團法人國家衛生研究院,NHRI,國家衛生研究院,hyweb,1,1,15-7月 -11 10.52.03.236000000 下午,hyweb,
// 8a8a846432fafc420132fc7eb24b0002,2,1,細胞及系統醫學研究所,CS,,960334,3,1,23-5月 -16 09.56.11.618000000 上午,10504,0
// 8a8a846432fafc420132fc7f1d590003,2,1,環境衛生與職業醫學研究組,EO,,970401-1,5,1,14-5月 -15 09.24.11.192000000 上午,10504,0
// 8ac0ab973ace10f1013ad8888dc503a2,3,8a8a84d93079c04001307a11e7c00001,群體健康科學研究所老年醫學研究組,PH,,900613,3,0,05-12月-12 09.03.52.293000000 上午,10504,0
// 8a8a846432fafc420132fc8000860005,2,1,免疫醫學研究中心,IM,,960810,6,1,30-10月-12 04.31.10.454000000 下午,hyweb,0
// 8a8a846432fafc420132fc80d6830006,2,1,感染症與疫苗研究所,IV,,80807,7,1,13-8月 -19 03.39.10.066000000 下午,10504,0
// 8a8a846432fafc420132fc81302c0007,2,1,醫學工程研究組,ME,,101,8,0,01-3月 -18 05.17.46.693000000 下午,10504,0
// 8a8a846432fafc420132fc818dec0008,2,1,分子與基因醫學研究所,MG,,61008,9,1,05-10月-17 03.49.20.843000000 下午,10504,0
// 8a8a846432fafc420132fc81e4b70009,2,1,奈米醫學研究中心,NM,,101,10,0,01-3月 -18 05.17.35.846000000 下午,10504,0
// 2c90829732fc6dd80132fc7a9c200001,2,1,生技與藥物研究所,BP,,880802,1,1,12-9月 -17 11.28.46.959000000 上午,10504,0
// 8a8a846432fafc420132fc87c904000b,2,2,實驗動物中心,LA,,000321-1,1,1,08-1月 -20 03.10.33.244000000 下午,10504,0
// 8a8a846432fafc420132fc98da180015,2,4,核心儀器設施中心,CI,,970616-1,2,1,16-3月 -16 08.40.05.719000000 上午,10504,0
// 8a8a846432fafc420132fc99b3a00017,2,4,基因轉殖鼠核心實驗室,TM,,960810-1,5,1,06-12月-12 06.49.19.087000000 下午,10504,0
// 8a8a846432fafc420132fc8a8ebb000e,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,會計室,AC,,850203,1,1,30-10月-12 04.39.53.806000000 下午,hyweb,1
// 8a8a846432fafc420132fc8af267000f,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,總務室,AG,,070622-1,2,1,02-10月-18 10.24.19.362000000 上午,10504,1
// 8a8a846432fafc420132fc8b3d7a0010,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,人事室,AP,,890609,3,1,27-2月 -19 11.51.00.076000000 上午,10504,1
// 8a8a846432fafc420132fc8babd40011,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,營繕設管中心,CM,,70622,4,1,05-7月 -18 02.09.15.682000000 下午,10504,1
// 8a8a846432fafc420132fc8c29700012,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,採購中心,PC,,850147,5,1,27-2月 -19 11.57.09.256000000 上午,10504,1
// 8a8a846432fafc420132fc8c89050013,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,資訊中心,RC,,70823,6,1,02-1月 -19 09.39.25.200000000 上午,10504,1
// 8a8a846432fafc420132fc8cf1340014,3,8a8a89fd2ed7c3f0012ed7c5d8e90001,圖書館,RL,,901101-1,7,1,08-5月 -17 09.54.05.359000000 上午,10504,1
// 8a8a846432fafc420132fc996fd00016,2,4,生醫資源中心,RP,,891107-1,4,1,02-4月 -18 08.46.28.747000000 上午,10504,0
// 8a8a846432fafc420132fc9a19bc0018,2,5,秘書室,AS,,880605,1,1,05-6月 -18 02.40.43.014000000 下午,10504,0
// 8a8a846432fafc420132fc9a6fcb0019,2,5,稽核室,AU,,851104,2,1,27-2月 -19 11.51.41.117000000 上午,10504,0
// 8a8a846432fafc420132fc9ac212001a,2,5,環境暨職業安全衛生室,ES,,901018,3,1,30-10月-12 05.04.15.956000000 下午,hyweb,0
// 8a8a846432fafc420132fc9b05e1001b,2,5,編輯中心,PB,,850710,4,1,30-10月-12 05.04.42.150000000 下午,hyweb,0
// 8a8a846432fafc420132fc9b4a7c001c,2,5,英文編輯室,SE,,960820,5,1,30-10月-12 05.05.21.460000000 下午,hyweb,0
// 1,1,dept_root_id,研究部門,1,group,hyweb,1,1,13-10月-11 12.00.00.000000000 上午,hyweb,
// 2,1,dept_root_id,研究支援部門,2,group,hyweb,2,1,13-10月-11 12.00.00.000000000 上午,hyweb,
// 3,1,dept_root_id,行政管理部門,3,group,hyweb,3,1,13-10月-11 12.00.00.000000000 上午,hyweb,
// 4,1,dept_root_id,專案單位,4,group,hyweb,4,1,13-10月-11 12.00.00.000000000 上午,hyweb,
// 5,1,dept_root_id,行政部門,5,group,hyweb,5,1,13-10月-11 12.00.00.000000000 上午,hyweb,
// 8ac0ab973ace10f1013ad88aaba403a3,3,8a8a84d93079c04001307a11e7c00001,群體健康科學研究所臨床試驗統計組,PH,,870804,4,0,05-12月-12 09.04.01.814000000 上午,10504,0
// 8ac0ab973ace10f1013ad88c9b7d03a4,3,8a8a84d93079c04001307a11e7c00001,群體健康科學研究所衛生政策轉譯研究組,PH,,860910,5,0,05-12月-12 09.04.11.369000000 上午,10504,0
// 8ac0ab973ace10f1013ad4ca4595035b,3,8a8a84d93079c04001307a11e7c00001,群體健康科學研究所醫療保健研究組,PH,,990812,2,0,05-12月-12 09.03.43.960000000 上午,10504,0
// 8ac0ab973f78295101403dad726f0d7f,2,1,生醫工程與奈米醫學研究所,BN,簡稱-醫工奈米所,30818,2,1,14-8月 -14 11.58.37.060000000 上午,10504,0
// 8ac0ab97411b4b41014125bcbdc100d8,2,6,第二測試單位,T2,,PD02TEST,5,0,17-9月 -13 12.01.16.829000000 下午,10504,0
// 8ac0ab974cb54e35014cfe75d36105a1,2,1,國家環境醫學研究所,EM,,hyweb,5,1,18-8月 -20 03.37.36.102000000 下午,hyweb,0
// 8ac0ab973a2b374a013a6d1fb4dd01ec,2,1,神經及精神醫學研究中心,NP,,90111,11,1,06-1月 -20 05.45.36.477000000 下午,10504,0
// 8ac0ab973a2b374a013a6d2cd46201ed,2,1,國家環境毒物研究中心,EH,,030804-1,4,1,18-5月 -15 01.05.27.208000000 下午,10504,0
// 8ac0ab973a9c091d013aafcab53e0001,2,4,動物行為核心設施,AB,,010202-1,1,1,20-8月 -14 05.08.03.022000000 下午,10504,0
// 8ac0ab973a9c091d013aafcb228f0002,2,4,病理核心實驗室,PT,,920503-1,3,1,06-12月-12 06.48.59.168000000 下午,10504,0
// 8ac0ab973a9c091d013aafcc0c320003,2,6,主任秘書室,PL,,70117,1,1,19-4月 -18 09.31.34.507000000 上午,10504,0
// 8ac0ab973a9c091d013aafcc4f100004,2,6,院長室,PP,,61206,2,1,14-12月-17 02.35.56.499000000 下午,10504,0
// 8ac0ab973a9c091d013aafcc92100005,2,6,副院長室,VP,,70201,3,1,19-4月 -18 09.32.09.620000000 上午,10504,0
// 8ac0ab973ace10f1013ad4c66a92035a,3,8a8a84d93079c04001307a11e7c00001,群體健康科學研究所生物統計與生物資訊研究組,PH,,860910,1,0,05-12月-12 09.03.32.053000000 上午,10504,0
// 8ac0ab97404df5f201411545dad70931,2,6,系統測試用(勿選),QT,qt-quit,010504-1,4,1,13-1月 -17 03.39.22.576000000 下午,10504,0
// 8ac0ab9745f4287c0146cba779650ffb,2,4,國衛院論壇,FR,"現在的代碼似乎為FO上面權責單位為院長室。",FR01WU,3,1,20-3月 -15 11.38.14.867000000 上午,10504,0
// 6,1,dept_root_id,其他單位,6,group,hyweb,6,1,30-10月-12 11.31.16.278000000 上午,hyweb,
// 8ac0ab973b655908013b840649070769,3,8ac0ab973a9c091d013aafcc92100005,學務辦公室(自109.05.01起併入學發處),SA,自109.05.01起併入學發處,980943-1,1,1,11-5月 -20 10.22.16.488000000 上午,10504,0
// 8ac0ab97544b61ed0155234f01670b4b,2,1,國家蚊媒傳染病防治研究中心,MR,,080807-1,10,1,13-8月 -19 03.39.32.725000000 下午,10504,0
// `


//     const lines = inputString.split('\n');
//     const headers = ["uuid", "depth", "parent_uuid", "name", "dept_id", "description", "chief", "priority", "status", "modify_date", "modify_by", "upper_certify"];

//     const resultArray = lines.map(line => {
//         const values = line.split(',');
//         return headers.reduce((obj, header, index) => {
//             // console.log("values[index] " + values[index]);
//             obj[header] = values[index];
//             return obj;
//         }, {});
//     });



//     // console.log(resultArray);
//     console.log(JSON.stringify(resultArray));

//     return JSON.stringify(resultArray, null, 2);
// }

// 导出所有函数的对象
export const globalFunctions = {
    function1,
    function2,
    // convertToJSON,
};

